TexasInstruments/c2000ware-core-sdk/driverlib/f2807x/driverlib/adc.h
    HWREGH(intRegAddr) |= ADC_INTSEL1N2_INT1CONT << shiftVal;

    EDIS;
}

//*****************************************************************************
//
//! Disables continuous mode for an ADC interrupt.
//!
//! \param base is the base address of the ADC.
//! \param adcIntNum is interrupt number within the ADC wrapper.
//!
//! This function disables continuous mode for the ADC interrupt passed into
//! \e adcIntNum. This means that pulses will not be generated for the
//! specified ADC interrupt until the corresponding interrupt flag for the
//! previous interrupt occurrence has been cleared using
//! ADC_clearInterruptStatus().
//!
//! \e adcIntNum can take the value \b ADC_INT_NUMBER1,
//! \b ADC_INT_NUMBER2, \b ADC_INT_NUMBER3 or \b ADC_INT_NUMBER4 to express
//! which of the four interrupts of the ADC module is being configured.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ADC_disableContinuousMode(uint32_t base, ADC_IntNumber adcIntNum)
{
    uint32_t intRegAddr;
    uint16_t shiftVal;

    //
    // Check the arguments.
    //
    ASSERT(ADC_isBaseValid(base));

    //
    // Each INTSEL register manages two interrupts. If the interrupt number is
    // even, we'll be accessing the upper byte and will need to shift.
    //
    intRegAddr = base + ADC_INTSELxNy_OFFSET_BASE + ((uint32_t)adcIntNum >> 1);
    shiftVal = ((uint16_t)adcIntNum & 0x1U) << 3U;

    //
    // Disable continuous mode for the specified ADC interrupt.
    //
    EALLOW;

    HWREGH(intRegAddr) &= ~(ADC_INTSEL1N2_INT1CONT << shiftVal);

    EDIS;
}

//*****************************************************************************
//
//! Converts temperature from sensor reading to degrees C
//!
//! \param tempResult is the raw ADC A conversion result from the temp sensor.
//! \param vref is the reference voltage being used (for example 3.3 for 3.3V).
//!
//! This function converts temperature from temp sensor reading to degrees C.
//! Temp sensor values in production test are derived with 2.5V reference.
//! The \b vref argument in the function is used to scale the temp sensor
//! reading accordingly if temp sensor value is read at a different VREF
//! setting.
//!
//! \return Returns the temperature sensor reading converted to degrees C.
//
//*****************************************************************************
static inline int16_t
ADC_getTemperatureC(uint16_t tempResult, float32_t vref)
{
    int16_t tsOffset, tsSlope;
    float32_t temp;

    //
    // Check the device revision
    //
    if(HWREGH(DEVCFG_BASE + SYSCTL_O_REVID) >= 3)
    {
        //
        // For production devices (Rev. C), pull the slope and offset from OTP
        //
#ifdef __TMS320C28XX__

    //
    // Only accessible from the CPU.
    //
        tsSlope = (int16_t)ADC_getTempSlope();
        tsOffset = (int16_t)ADC_getTempOffset();
#endif
    }
    else
    {
        //
        // For pre-production devices, use these static values for slope
        // and offset
        //
        tsSlope = 5196;
        tsOffset = 1788;
    }

    //
    // The slope is stored as a Q15 fixed point number hence the need to
    // to an integer.
    //
    temp = (((float32_t)tempResult * (vref / 2.5F)) - (float32_t)tsOffset) *
           (float32_t)tsSlope;
    return((int16_t)((((int32_t)temp + (int32_t)0x4000 +
                       ((int32_t)273 * (int32_t)0x8000)) /
                      (int32_t)0x8000) - (int32_t)273));
}

//*****************************************************************************
//
//! Converts temperature from sensor reading to degrees K
//!
//! \param tempResult is the raw ADC A conversion result from the temp sensor.
//! \param vref is the reference voltage being used (for example 3.3 for 3.3V).
//!
//! This function converts temperature from temp sensor reading to degrees K.
//! Temp sensor values in production test are derived with 2.5V reference.
//! The \b vref argument in the function is used to scale the temp sensor
//! reading accordingly if temp sensor value is read at a different VREF
//! setting.
//!
//! \return Returns the temperature sensor reading converted to degrees K.
//
//*****************************************************************************
static inline int16_t
ADC_getTemperatureK(uint16_t tempResult, float32_t vref)
{
    int16_t tsOffset, tsSlope;
    float32_t temp;

    //
    // Check the device revision
    //
    if(HWREGH(DEVCFG_BASE + SYSCTL_O_REVID) >= 3)
    {
        //
        // For production devices (Rev. C), pull the slope and offset from OTP
        //
#ifdef __TMS320C28XX__

    //
    // Only accessible from the CPU.
    //
        tsSlope = (int16_t)ADC_getTempSlope();
        tsOffset = (int16_t)ADC_getTempOffset();
#endif
    }
    else
    {
        //
        // For pre-production devices, use these static values for slope
        // and offset
        //
        tsSlope = 5196;
        tsOffset = 1788;
    }

    //
    // The slope is stored as a Q15 fixed point number hence the need to
    // to an integer.
    //
    temp = (((float32_t)tempResult * (vref / 2.5F)) - (float32_t)tsOffset) *
           (float32_t)tsSlope;
    return((int16_t)(((int32_t)temp + (int32_t)0x4000 + ((int32_t)273 *
                     (int32_t)0x8000)) / (int32_t)0x8000));
}



//*****************************************************************************
//
//! Configures the offset trim for the desired ADC instance
//!
//! \param base is the base address of the ADC module.
//!
//! This function loads the offset trims for the desired ADC instance.
//!
//! \return None.
//
//*****************************************************************************
extern void
ADC_setOffsetTrim(uint32_t base);

//*****************************************************************************
//
//! Configures the INL trim for the desired ADC instance
//!
//! \param base is the base address of the ADC module.
//!
//! This function loads the INL trims for the desired ADC instance.
//!
//! \return None.
//
//*****************************************************************************
extern void
ADC_setINLTrim(uint32_t base);

//*****************************************************************************
//
//! Sets the windowed trip limits for a PPB.
//!
//! \param base is the base address of the ADC module.
//! \param ppbNumber is the number of the post-processing block.
//! \param tripHiLimit is the value is the digital comparator trip high limit.
//! \param tripLoLimit is the value is the digital comparator trip low limit.
//!
//! This function sets the windowed trip limits for a PPB. These values set
//! the digital comparator so that when one of the values is exceeded, either a
//! high or low trip event will occur.
//!
//! The \e ppbNumber is a value \b ADC_PPB_NUMBERX where X is a value from 1 to
//! 4 inclusive that identifies a PPB to be configured.
//!
//! If using 16-bit mode, you may pass a 17-bit number into the \e tripHiLimit
//! and \e tripLoLimit parameters where the 17th bit is the sign bit (that is
//! a value from -65536 and 65535). In 12-bit mode, only bits 12:0 will be
//! compared against bits 12:0 of the PPB result.
//!
//! \note On some devices, signed trip values do not work properly. See the
//! silicon errata for details.
//!
//! \return None.
//
//*****************************************************************************
extern void
ADC_setPPBTripLimits(uint32_t base, ADC_PPBNumber ppbNumber,
                     int32_t tripHiLimit, int32_t tripLoLimit);


//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif // ADC_H
